AlmAck/svdtonuttx/demo/h/da1470_i2c.h
#define I2C_I2C_ACK_GENERAL_CALL_ACK_GEN_CALL          (1U << 0) /* ACK General Call. When set to 1, I2C Ctrl responds with a ACK (by asserting ic_d */
#define I2C_I2C_CLR_ACTIVITY_CLR_ACTIVITY              (1U << 0) /* Reading this register clears the ACTIVITY interrupt if the I2C is not active any */
#define I2C_I2C_CLR_GEN_CALL_CLR_GEN_CALL              (1U << 0) /* Read this register to clear the GEN_CALL interrupt (bit 11) of I2C_RAW_INTR_STAT */
#define I2C_I2C_CLR_INTR_CLR_INTR                      (1U << 0) /* Read this register to clear the combined interrupt, all individual interrupts, a */
#define I2C_I2C_CLR_RD_REQ_CLR_RD_REQ                  (1U << 0) /* Read this register to clear the RD_REQ interrupt (bit 5) of the I2C_RAW_INTR_STA */
#define I2C_I2C_CLR_RX_DONE_CLR_RX_DONE                (1U << 0) /* Read this register to clear the RX_DONE interrupt (bit 7) of the I2C_RAW_INTR_ST */
#define I2C_I2C_CLR_RX_OVER_CLR_RX_OVER                (1U << 0) /* Read this register to clear the RX_OVER interrupt (bit 1) of the I2C_RAW_INTR_ST */
#define I2C_I2C_CLR_RX_UNDER_CLR_RX_UNDER              (1U << 0) /* Read this register to clear the RX_UNDER interrupt (bit 0) of the I2C_RAW_INTR_S */
#define I2C_I2C_CLR_START_DET_CLR_START_DET            (1U << 0) /* Read this register to clear the START_DET interrupt (bit 10) of the IC_RAW_INTR_ */
#define I2C_I2C_CLR_STOP_DET_CLR_STOP_DET              (1U << 0) /* Read this register to clear the STOP_DET interrupt (bit 9) of the IC_RAW_INTR_ST */
#define I2C_I2C_CLR_TX_ABRT_CLR_TX_ABRT                (1U << 0) /* Read this register to clear the TX_ABRT interrupt (bit 6) of the IC_RAW_INTR_STA */
#define I2C_I2C_CLR_TX_OVER_CLR_TX_OVER                (1U << 0) /* Read this register to clear the TX_OVER interrupt (bit 3) of the I2C_RAW_INTR_ST */
#define I2C_I2C_CON_I2C_STOP_DET_IF_MASTER_ACTIVE      (1U << 10) /* In Master mode: 1 = issues the STOP_DET interrupt only when master is active. 0  */
#define I2C_I2C_CON_I2C_RX_FIFO_FULL_HLD_CTRL          (1U << 9) /* This bit controls whether DW_apb_i2c should hold the bus when the Rx FIFO is phy */
#define I2C_I2C_CON_I2C_TX_EMPTY_CTRL                  (1U << 8) /* This bit controls the generation of the TX_EMPTY interrupt, as described in the  */
#define I2C_I2C_CON_I2C_STOP_DET_IFADDRESSED           (1U << 7) /* 1 = slave issues STOP_DET intr only if addressed 0 = slave issues STOP_DET intr  */
#define I2C_I2C_CON_I2C_SLAVE_DISABLE                  (1U << 6) /* Slave enabled or disabled after reset is applied, which means software does not  */
#define I2C_I2C_CON_I2C_RESTART_EN                     (1U << 5) /* Determines whether RESTART conditions may be sent when acting as a master 0= dis */
#define I2C_I2C_CON_I2C_10BITADDR_MASTER               (1U << 4) /* Controls whether the controller starts its transfers in 7- or 10-bit addressing  */
#define I2C_I2C_CON_I2C_10BITADDR_SLAVE                (1U << 3) /* When acting as a slave, this bit controls whether the controller responds to 7-  */
#define I2C_I2C_CON_I2C_SPEED_MASK                     (0x3 << 1) /* These bits control at which speed the controller operates. 1= standard mode (100 */
#define I2C_I2C_CON_I2C_SPEED_POS                      (1) /* These bits control at which speed the controller operates. 1= standard mode (100 */
#define I2C_I2C_CON_I2C_MASTER_MODE                    (1U << 0) /* This bit controls whether the controller master is enabled. 0= master disabled 1 */
#define I2C_I2C_DATA_CMD_I2C_RESTART                   (1U << 10) /* This bit controls whether a RESTART is issued before the byte is sent or receive */
#define I2C_I2C_DATA_CMD_I2C_STOP                      (1U << 9) /* This bit controls whether a STOP is issued after the byte is sent or received. 1 */
#define I2C_I2C_DATA_CMD_I2C_CMD                       (1U << 8) /* This bit controls whether a read or a write is performed. This bit does not cont */
#define I2C_I2C_DATA_CMD_I2C_DAT_MASK                  (0xFF << 0) /* This register contains the data to be transmitted or received on the I2C bus. If */
#define I2C_I2C_DATA_CMD_I2C_DAT_POS                   (0) /* This register contains the data to be transmitted or received on the I2C bus. If */
#define I2C_I2C_DMA_CR_TDMAE                           (1U << 1) /* Transmit DMA Enable. //This bit enables/disables the transmit FIFO DMA channel.  */
#define I2C_I2C_DMA_CR_RDMAE                           (1U << 0) /* Receive DMA Enable. This bit enables/disables the receive FIFO DMA channel. 0 =  */
#define I2C_I2C_DMA_RDLR_DMARDL_MASK                   (0x1F << 0) /* Receive Data Level. This bit field controls the level at which a DMA request is  */
#define I2C_I2C_DMA_RDLR_DMARDL_POS                    (0) /* Receive Data Level. This bit field controls the level at which a DMA request is  */
#define I2C_I2C_DMA_TDLR_DMATDL_MASK                   (0x1F << 0) /* Transmit Data Level. This bit field controls the level at which a DMA request is */
#define I2C_I2C_DMA_TDLR_DMATDL_POS                    (0) /* Transmit Data Level. This bit field controls the level at which a DMA request is */
#define I2C_I2C_ENABLE_I2C_TX_CMD_BLOCK                (1U << 2) /* In Master mode: 1 = Blocks the transmission of data on I2C bus even if Tx FIFO h */
#define I2C_I2C_ENABLE_I2C_ABORT                       (1U << 1) /* The software can abort the I2C transfer in master mode by setting this bit. The  */
#define I2C_I2C_ENABLE_I2C_EN                          (1U << 0) /* Controls whether the controller is enabled. 0 = Disables the controller (TX and  */
#define I2C_I2C_ENABLE_STATUS_SLV_RX_DATA_LOST         (1U << 2) /* Slave Received Data Lost. This bit indicates if a Slave-Receiver operation has b */
#define I2C_I2C_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY  (1U << 1) /* Slave Disabled While Busy (Transmit, Receive). This bit indicates if a potential */
#define I2C_I2C_ENABLE_STATUS_IC_EN                    (1U << 0) /* ic_en Status. This bit always reflects the value driven on the output port ic_en */
#define I2C_I2C_FS_SCL_HCNT_IC_FS_SCL_HCNT_MASK        (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C_I2C_FS_SCL_HCNT_IC_FS_SCL_HCNT_POS         (0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C_I2C_FS_SCL_LCNT_IC_FS_SCL_LCNT_MASK        (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C_I2C_FS_SCL_LCNT_IC_FS_SCL_LCNT_POS         (0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C_I2C_HS_MADDR_I2C_IC_HS_MAR_MASK            (0x7 << 0) /* This bit field holds the value of the I2C HS mode master code. HS-mode master co */
#define I2C_I2C_HS_MADDR_I2C_IC_HS_MAR_POS             (0) /* This bit field holds the value of the I2C HS mode master code. HS-mode master co */
#define I2C_I2C_HS_SCL_HCNT_IC_HS_SCL_HCNT_MASK        (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C_I2C_HS_SCL_HCNT_IC_HS_SCL_HCNT_POS         (0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C_I2C_HS_SCL_LCNT_IC_HS_SCL_LCNT_MASK        (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C_I2C_HS_SCL_LCNT_IC_HS_SCL_LCNT_POS         (0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C_I2C_IC_FS_SPKLEN_I2C_FS_SPKLEN_MASK        (0xFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C_I2C_IC_FS_SPKLEN_I2C_FS_SPKLEN_POS         (0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C_I2C_IC_HS_SPKLEN_I2C_HS_SPKLEN_MASK        (0xFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C_I2C_IC_HS_SPKLEN_I2C_HS_SPKLEN_POS         (0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C_I2C_INTR_MASK_M_SCL_STUCK_AT_LOW           (1U << 14) /* M_SCL_STUCK_AT_LOW Register field Reserved bits */
#define I2C_I2C_INTR_MASK_M_MASTER_ON_HOLD             (1U << 13) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C_I2C_INTR_MASK_M_RESTART_DET                (1U << 12) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C_I2C_INTR_MASK_M_GEN_CALL                   (1U << 11) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C_I2C_INTR_MASK_M_START_DET                  (1U << 10) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C_I2C_INTR_MASK_M_STOP_DET                   (1U << 9) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C_I2C_INTR_MASK_M_ACTIVITY                   (1U << 8) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C_I2C_INTR_MASK_M_RX_DONE                    (1U << 7) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C_I2C_INTR_MASK_M_TX_ABRT                    (1U << 6) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C_I2C_INTR_MASK_M_RD_REQ                     (1U << 5) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C_I2C_INTR_MASK_M_TX_EMPTY                   (1U << 4) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C_I2C_INTR_MASK_M_TX_OVER                    (1U << 3) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C_I2C_INTR_MASK_M_RX_FULL                    (1U << 2) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C_I2C_INTR_MASK_M_RX_OVER                    (1U << 1) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C_I2C_INTR_MASK_M_RX_UNDER                   (1U << 0) /* These bits mask their corresponding interrupt status bits in the I2C_INTR_STAT r */
#define I2C_I2C_INTR_STAT_R_SCL_STUCK_AT_LOW           (1U << 14) /* 1 = R_SCL_STUCK_AT_LOW interrupt is active 0 = R_SCL_STUCK_AT_LOW interrupt is i */
#define I2C_I2C_INTR_STAT_R_MASTER_ON_HOLD             (1U << 13) /* Indicates whether master is holding the bus and TX FIFO is empty. Enabled only w */
#define I2C_I2C_INTR_STAT_R_RESTART_DET                (1U << 12) /* Indicates whether a RESTART condition has occurred on the I2C interface when DW_ */
#define I2C_I2C_INTR_STAT_R_GEN_CALL                   (1U << 11) /* Set only when a General Call address is received and it is acknowledged. It stay */
#define I2C_I2C_INTR_STAT_R_START_DET                  (1U << 10) /* Indicates whether a START or RESTART condition has occurred on the I2C interface */
#define I2C_I2C_INTR_STAT_R_STOP_DET                   (1U << 9) /* Indicates whether a STOP condition has occurred on the I2C interface regardless  */
#define I2C_I2C_INTR_STAT_R_ACTIVITY                   (1U << 8) /* This bit captures I2C Ctrl activity and stays set until it is cleared. There are */
#define I2C_I2C_INTR_STAT_R_RX_DONE                    (1U << 7) /* When the controller is acting as a slave-transmitter, this bit is set to 1 if th */
#define I2C_I2C_INTR_STAT_R_TX_ABRT                    (1U << 6) /* This bit indicates if the controller, as an I2C transmitter, is unable to comple */
#define I2C_I2C_INTR_STAT_R_RD_REQ                     (1U << 5) /* This bit is set to 1 when the controller is acting as a slave and another I2C ma */
#define I2C_I2C_INTR_STAT_R_TX_EMPTY                   (1U << 4) /* This bit is set to 1 when the transmit buffer is at or below the threshold value */
#define I2C_I2C_INTR_STAT_R_TX_OVER                    (1U << 3) /* Set during transmit if the transmit buffer is filled to 32 and the processor att */
#define I2C_I2C_INTR_STAT_R_RX_FULL                    (1U << 2) /* Set when the receive buffer reaches or goes above the RX_TL threshold in the I2C */
#define I2C_I2C_INTR_STAT_R_RX_OVER                    (1U << 1) /* Set if the receive buffer is completely filled to 32 and an additional byte is r */
#define I2C_I2C_INTR_STAT_R_RX_UNDER                   (1U << 0) /* Set if the processor attempts to read the receive buffer when it is empty by rea */
#define I2C_I2C_RAW_INTR_STAT_SCL_STUCK_AT_LOW         (1U << 14) /* CL_STUCK_AT_LOW Register field Reserved bits */
#define I2C_I2C_RAW_INTR_STAT_MASTER_ON_HOLD           (1U << 13) /* ndicates whether master is holding the bus and TX FIFO is empty. Enabled only wh */
#define I2C_I2C_RAW_INTR_STAT_RESTART_DET              (1U << 12) /* Indicates whether a RESTART condition has occurred on the I2C interface when DW_ */
#define I2C_I2C_RAW_INTR_STAT_GEN_CALL                 (1U << 11) /* Set only when a General Call address is received and it is acknowledged. It stay */
#define I2C_I2C_RAW_INTR_STAT_START_DET                (1U << 10) /* Indicates whether a START or RESTART condition has occurred on the I2C interface */
#define I2C_I2C_RAW_INTR_STAT_STOP_DET                 (1U << 9) /* Indicates whether a STOP condition has occurred on the I2C interface regardless  */
#define I2C_I2C_RAW_INTR_STAT_ACTIVITY                 (1U << 8) /* This bit captures I2C Ctrl activity and stays set until it is cleared. There are */
#define I2C_I2C_RAW_INTR_STAT_RX_DONE                  (1U << 7) /* When the controller is acting as a slave-transmitter, this bit is set to 1 if th */
#define I2C_I2C_RAW_INTR_STAT_TX_ABRT                  (1U << 6) /* This bit indicates if the controller, as an I2C transmitter, is unable to comple */
#define I2C_I2C_RAW_INTR_STAT_RD_REQ                   (1U << 5) /* This bit is set to 1 when I2C Ctrl is acting as a slave and another I2C master i */
#define I2C_I2C_RAW_INTR_STAT_TX_EMPTY                 (1U << 4) /* This bit is set to 1 when the transmit buffer is at or below the threshold value */
#define I2C_I2C_RAW_INTR_STAT_TX_OVER                  (1U << 3) /* Set during transmit if the transmit buffer is filled to 32 and the processor att */
#define I2C_I2C_RAW_INTR_STAT_RX_FULL                  (1U << 2) /* Set when the receive buffer reaches or goes above the RX_TL threshold in the I2C */
#define I2C_I2C_RAW_INTR_STAT_RX_OVER                  (1U << 1) /* Set if the receive buffer is completely filled to 32 and an additional byte is r */
#define I2C_I2C_RAW_INTR_STAT_RX_UNDER                 (1U << 0) /* Set if the processor attempts to read the receive buffer when it is empty by rea */
#define I2C_I2C_RXFLR_RXFLR_MASK                       (0x3F << 0) /* Receive FIFO Level. Contains the number of valid data entries in the receive FIF */
#define I2C_I2C_RXFLR_RXFLR_POS                        (0) /* Receive FIFO Level. Contains the number of valid data entries in the receive FIF */
#define I2C_I2C_RX_TL_RX_TL_MASK                       (0x1F << 0) /* Receive FIFO Threshold Level Controls the level of entries (or above) that trigg */
#define I2C_I2C_RX_TL_RX_TL_POS                        (0) /* Receive FIFO Threshold Level Controls the level of entries (or above) that trigg */
#define I2C_I2C_SAR_IC_SAR_MASK                        (0x3FF << 0) /* The IC_SAR holds the slave address when the I2C is operating as a slave. For 7-b */
#define I2C_I2C_SAR_IC_SAR_POS                         (0) /* The IC_SAR holds the slave address when the I2C is operating as a slave. For 7-b */
#define I2C_I2C_SDA_HOLD_I2C_SDA_RX_HOLD_MASK          (0xFF << 16) /* Sets the required SDA hold time in units of ic_clk period, when receiver. */
#define I2C_I2C_SDA_HOLD_I2C_SDA_RX_HOLD_POS           (16) /* Sets the required SDA hold time in units of ic_clk period, when receiver. */
#define I2C_I2C_SDA_HOLD_I2C_SDA_TX_HOLD_MASK          (0xFFFF << 0) /* Sets the required SDA hold time in units of ic_clk period, when transmitter. */
#define I2C_I2C_SDA_HOLD_I2C_SDA_TX_HOLD_POS           (0) /* Sets the required SDA hold time in units of ic_clk period, when transmitter. */
#define I2C_I2C_SDA_SETUP_SDA_SETUP_MASK               (0xFF << 0) /* SDA Setup. This register controls the amount of time delay (number of I2C clock  */
#define I2C_I2C_SDA_SETUP_SDA_SETUP_POS                (0) /* SDA Setup. This register controls the amount of time delay (number of I2C clock  */
#define I2C_I2C_SS_SCL_HCNT_IC_SS_SCL_HCNT_MASK        (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C_I2C_SS_SCL_HCNT_IC_SS_SCL_HCNT_POS         (0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C_I2C_SS_SCL_LCNT_IC_SS_SCL_LCNT_MASK        (0xFFFF << 0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C_I2C_SS_SCL_LCNT_IC_SS_SCL_LCNT_POS         (0) /* This register must be set before any I2C bus transaction can take place to ensur */
#define I2C_I2C_STATUS_LV_HOLD_RX_FIFO_FULL            (1U << 10) /* This bit indicates the BUS Hold in Slave mode due to Rx FIFO is Full and an addi */
#define I2C_I2C_STATUS_SLV_HOLD_TX_FIFO_EMPTY          (1U << 9) /* This bit indicates the BUS Hold in Slave mode for the Read request when the Tx F */
#define I2C_I2C_STATUS_MST_HOLD_RX_FIFO_FULL           (1U << 8) /* This bit indicates the BUS Hold in Master mode due to Rx FIFO is Full and additi */
#define I2C_I2C_STATUS_MST_HOLD_TX_FIFO_EMPTY          (1U << 7) /* the DW_apb_i2c master stalls the write transfer when Tx FIFO is empty, and the t */
#define I2C_I2C_STATUS_SLV_ACTIVITY                    (1U << 6) /* Slave FSM Activity Status. When the Slave Finite State Machine (FSM) is not in t */
#define I2C_I2C_STATUS_MST_ACTIVITY                    (1U << 5) /* Master FSM Activity Status. When the Master Finite State Machine (FSM) is not in */
#define I2C_I2C_STATUS_RFF                             (1U << 4) /* Receive FIFO Completely Full. When the receive FIFO is completely full, this bit */
#define I2C_I2C_STATUS_RFNE                            (1U << 3) /* Receive FIFO Not Empty. This bit is set when the receive FIFO contains one or mo */
#define I2C_I2C_STATUS_TFE                             (1U << 2) /* Transmit FIFO Completely Empty. When the transmit FIFO is completely empty, this */
#define I2C_I2C_STATUS_TFNF                            (1U << 1) /* Transmit FIFO Not Full. Set when the transmit FIFO contains one or more empty lo */
#define I2C_I2C_STATUS_I2C_ACTIVITY                    (1U << 0) /* I2C Activity Status. */
#define I2C_I2C_TAR_SPECIAL                            (1U << 11) /* On read This bit indicates whether software performs a General Call or START BYT */
#define I2C_I2C_TAR_GC_OR_START                        (1U << 10) /* On read If bit 11 (SPECIAL) is set to 1, then this bit indicates whether a Gener */
#define I2C_I2C_TAR_IC_TAR_MASK                        (0x3FF << 0) /* This is the target address for any master transaction. When transmitting a Gener */
#define I2C_I2C_TAR_IC_TAR_POS                         (0) /* This is the target address for any master transaction. When transmitting a Gener */
#define I2C_I2C_TXFLR_TXFLR_MASK                       (0x3F << 0) /* Transmit FIFO Level. Contains the number of valid data entries in the transmit F */
#define I2C_I2C_TXFLR_TXFLR_POS                        (0) /* Transmit FIFO Level. Contains the number of valid data entries in the transmit F */
#define I2C_I2C_TX_ABRT_SOURCE_ABRT_USER_ABRT          (1U << 16) /* Master-Transmitter : This is a master-mode-only bit. Master has detected the tra */
#define I2C_I2C_TX_ABRT_SOURCE_ABRT_SLVRD_INTX         (1U << 15) /* Slave-Transmitter : When the processor side responds to a slave mode request for */
#define I2C_I2C_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST        (1U << 14) /* Slave-Transmitter : Slave lost the bus while transmitting data to a remote maste */
#define I2C_I2C_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO    (1U << 13) /* Slave-Transmitter : Slave has received a read command and some data exists in th */
#define I2C_I2C_TX_ABRT_SOURCE_ARB_LOST                (1U << 12) /* Master-Transmitter or Slave-Transmitter : Master has lost arbitration, or if I2C */
#define I2C_I2C_TX_ABRT_SOURCE_ABRT_MASTER_DIS         (1U << 11) /* Master-Transmitter or Master-Receiver : User tries to initiate a Master operatio */
#define I2C_I2C_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT     (1U << 10) /* Master-Receiver : The restart is disabled (IC_RESTART_EN bit (I2C_CON[5]) = 0) a */
#define I2C_I2C_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT      (1U << 9) /* Master : To clear Bit 9, the source of the ABRT_SBYTE_NORSTRT must be fixed firs */
#define I2C_I2C_TX_ABRT_SOURCE_ABRT_HS_NORSTRT         (1U << 8) /* Master-Transmitter or Master-Receiver : The restart is disabled (IC_RESTART_EN b */
#define I2C_I2C_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET       (1U << 7) /* Master : Master has sent a START Byte and the START Byte was acknowledged (wrong */
#define I2C_I2C_TX_ABRT_SOURCE_ABRT_HS_ACKDET          (1U << 6) /* Master : Master is in High Speed mode and the High Speed Master code was acknowl */
#define I2C_I2C_TX_ABRT_SOURCE_ABRT_GCALL_READ         (1U << 5) /* Master-Transmitter : The controller in master mode sent a General Call but the u */
#define I2C_I2C_TX_ABRT_SOURCE_ABRT_GCALL_NOACK        (1U << 4) /* Master-Transmitter : the controller in master mode sent a General Call and no sl */
#define I2C_I2C_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK       (1U << 3) /* Master-Transmitter : This is a master-mode only bit. Master has received an ackn */
#define I2C_I2C_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK      (1U << 2) /* Master-Transmitter or Master-Receiver : Master is in 10-bit address mode and the */
#define I2C_I2C_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK      (1U << 1) /* Master-Transmitter or Master-Receiver : Master is in 10-bit address mode and the */
#define I2C_I2C_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK      (1U << 0) /* Master-Transmitter or Master-Receiver : Master is in 7-bit addressing mode and t */
#define I2C_I2C_TX_TL_TX_TL_MASK                       (0x1F << 0) /* Transmit FIFO Threshold Level Controls the level of entries (or below) that trig */
#define I2C_I2C_TX_TL_TX_TL_POS                        (0) /* Transmit FIFO Threshold Level Controls the level of entries (or below) that trig */

#endif /* __DA1470_I2C_H */
